lyshgd148/STM32Pjo/1- IIC/Hardware/MPU6050.c
#include "stm32f10x.h"                  // Device header
#include "MyI2C.h"
#include "MPU6050Reg.h"

#define MPU6050_ADDRESS 0xD0

void MPU6050_WriteReg(uint8_t RegAddress,uint8_t Data){
	MyI2C_Strat();
	MyI2C_SendByte(MPU6050_ADDRESS);
	MyI2C_ReceiveAck();
	MyI2C_SendByte(RegAddress);
	MyI2C_ReceiveAck();
	MyI2C_SendByte(Data);
	MyI2C_ReceiveAck();
	MyI2C_Stop();
}

uint8_t MPU6050_ReadReg(uint8_t RegAddress){
	uint8_t Data;
	
	MyI2C_Strat();
	MyI2C_SendByte(MPU6050_ADDRESS);
	MyI2C_ReceiveAck();
	MyI2C_SendByte(RegAddress);
	MyI2C_ReceiveAck();
	
	MyI2C_Strat();
	MyI2C_SendByte(MPU6050_ADDRESS|0x01);
	MyI2C_ReceiveAck();
	Data=MyI2C_ReceiveByte();
	MyI2C_SendAck(1);
	MyI2C_Stop();
	
	return Data;
}

void MPU6050_Init(void){
	MyI2C_Init();
	MPU6050_WriteReg(MPU6050_PWR_MGMT_1,0x01);
	MPU6050_WriteReg(MPU6050_PWR_MGMT_2,0x00);
	MPU6050_WriteReg(MPU6050_SMPLRT_DIV,0x09);
	MPU6050_WriteReg(MPU6050_CONFIG,0x06);
	MPU6050_WriteReg(MPU6050_GYRO_CONFIG,0x18);
	MPU6050_WriteReg(MPU6050_ACCEL_CONFIG,0x18);
}

void MPU6050_GetData(int16_t * AccX,int16_t * AccY,int16_t * AccZ,
						int16_t * GyroX,int16_t * GyroY,int16_t * GyroZ)
{
	uint8_t Data_H,Data_L;
	
	Data_H=MPU6050_ReadReg(MPU6050_ACCEL_XOUT_H);
	Data_L=MPU6050_ReadReg(MPU6050_ACCEL_XOUT_L);
	*AccX=(Data_H<<8)|Data_L;
	
	Data_H=MPU6050_ReadReg(MPU6050_ACCEL_YOUT_H);
	Data_L=MPU6050_ReadReg(MPU6050_ACCEL_YOUT_L);
	*AccY=(Data_H<<8)|Data_L;
	
	Data_H=MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_H);
	Data_L=MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_L);
	*AccZ=(Data_H<<8)|Data_L;
	
	Data_H=MPU6050_ReadReg(MPU6050_GYRO_XOUT_H);
	Data_L=MPU6050_ReadReg(MPU6050_GYRO_XOUT_L);
	*GyroX=(Data_H<<8)|Data_L;
	
	Data_H=MPU6050_ReadReg(MPU6050_GYRO_YOUT_H);
	Data_L=MPU6050_ReadReg(MPU6050_GYRO_YOUT_L);
	*GyroY=(Data_H<<8)|Data_L;
	
	Data_H=MPU6050_ReadReg(MPU6050_GYRO_ZOUT_H);
	Data_L=MPU6050_ReadReg(MPU6050_GYRO_ZOUT_L);
	*GyroZ=(Data_H<<8)|Data_L;
}
